app/Http/Controllers/Api/User/AddMoneyController.php

    public function webhook(Request $request)
    {

        $message = json_encode($request->all());
        send_notification($message);


        try {

            $acc_no = $request->nuban;
            $user_amount = $request->amount;
            $session_id = $request->unique_reference;
            $payable = $request->amount_payable;
            $fee = $request->fee;

            $acct = VirtualAccount::where('account_no', $acc_no)->first()->user_id ?? null;

            if ($acct == null) {
                return response()->json([
                    'status' => false,
                    'message' => "account not found"
                ]);

            }


            $status = Transaction::where('session_id', $session_id)->first()->status ?? null;
---
select * from `virtual_accounts` where `account_no` = '6030170425' limit 1
select * from `transactions` where `session_id` = '0000000000' limit 1

            }


            UserWallet::where('user_id', $acct)->increment('balance', $p_amount);
            $user_wallet_id =  UserWallet::where('user_id', $acct)->first()->id;
---
update `user_wallets` set `balance` = `balance` + -100, `user_wallets`.`updated_at` = '2024-10-28 23:40:02' where `user_id` = 1
select * from `user_wallets` where `user_id` = 1 limit 1