app/Http/Controllers/User/AddMoneyController.php

    public function index()
    {


        $ck_va = VirtualAccount::where('user_id', Auth::id())->first() ?? null;
        $status = $var->status ?? null;

        if ($ck_va == null && Auth::user()->kyc_verified != 1) {
            return redirect('/user/authorize/kyc')->with(['error' => [__('You need to create a Virtual Account')]]);
        }


        $va = VirtualAccount::where('user_id', Auth::id())->first() ?? null;


        $page_title = __("Add Money");
        $user_wallets = UserWallet::auth()->get();
        $user_currencies = Currency::whereIn('id', $user_wallets->pluck('id')->toArray())->get();

        $payment_gateways_currencies = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::add_money_slug());
            $gateway->where('status', 1);
        })->get();
        $transactions = Transaction::auth()->addMoney()->latest()->take(5)->get();
---
select * from `virtual_accounts` where `user_id` = 1 limit 1
select * from `user_wallets` where `user_id` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'add-money' and `status` = 1)
select * from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' order by `created_at` desc limit 5