app/Http/Controllers/User/AuthorizationController.php

            $request->file('selfie_image')->move($destinationPath, $image_name);
            $im = get_user_image($image_name);
            $get_selfie_url = "$im/$image_name";
            User::where('id', Auth::id())->update(['selfie_image' => $get_selfie_url]);
---
update `users` set `selfie_image` = 'http://mydevhost.com/public/backend/images/user/profile/67443e8f4e41b_image-removebg-preview (17).png', `users`.`updated_at` = '2024-11-25 15:08:31' where `id` = 1

            $im = get_user_image($image_name);

            $get_doc_url = "$im/$image_name";
            User::where('id', Auth::id())->update(['doc_image' => $get_doc_url]);
---
update `users` set `doc_image` = 'http://mydevhost.com/public/backend/images/user/profile/67443e8f4f79c_image-removebg-preview (17).png', `users`.`updated_at` = '2024-11-25 15:08:31' where `id` = 1