app/Http/Controllers/User/DashboardController.php

select * from `transactions` where `user_id` = 1 order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where (`user_id` = 1 and `status` = 1 and `type` = 'SPRINT-PAY')
select count(*) as aggregate from `gift_cards` where `user_id` = 1
---
    public function index()
    {
        $page_title = __("Dashboard");
        $user = auth()->user();
        $baseCurrency = Currency::default();
        $transactions = Transaction::auth()->latest()->take(5)->get();
        $totalAddMoney = Transaction::where([
            'user_id' => Auth::id(),
            'status' => 1,
            'type' => "SPRINT-PAY",
        ])->sum('request_amount');
        $virtualCards = activeCardData()['active_cards'];
        $totalGiftCards = GiftCard::auth()->count();