app/Http/Controllers/User/StrowalletVirtualController.php

select * from `strowallet_virtual_cards` where `user_id` = 1 order by `created_at` desc limit 3
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 5
select * from `basic_settings` where `id` = 1 limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
---
    public function index()
    {
        $page_title     = __("Virtual Card");
        $myCards        = StrowalletVirtualCard::where('user_id', auth()->user()->id)->latest()->limit($this->card_limit)->get();
        $user           = auth()->user();
        $customer_email = $user->strowallet_customer->customerEmail??false;

        if($customer_email === false){
            $customer_card  = 0;
        }else{
            $customer_card  = StrowalletVirtualCard::where('customer_email',$customer_email)->count();
        }
        $cardCharge       = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $cardReloadCharge = TransactionSetting::where('slug','reload_card')->where('status',1)->first();
        $transactions     = Transaction::auth()->virtualCard()->latest()->take(5)->get();
        $cardApi = $this->api;
        $usd_rate = BasicSettings::where('id', 1)->first()->usd_amount;
        $wallet = UserWallet::where('user_id', Auth::id())->first()->balance;

select * from `strowallet_virtual_cards` where `card_id` = 'spun447212' limit 1
select * from `strowallet_virtual_cards` where `card_id` = 'db9983bb-a315-4791-a9cf-fc6408364b9f' limit 1
---
    public function cardDetails($card_id){


        $get_type = StrowalletVirtualCard::where('card_id',$card_id)->first() ?? null;
        if($get_type != null && $get_type->card_type == "Universal"){

            $page_title = __("Card Details");
            $card_type = "sprint";
            $myCard = StrowalletVirtualCard::where('card_id',$card_id)->first();
            return view('user.sections.virtual-card-strowallet.details',compact(
                'page_title',
                'myCard',
                'card_type',
            ));


        }


        $page_title = __("Card Details");
        $myCard = StrowalletVirtualCard::where('card_id',$card_id)->first();
        if(!$myCard) return back()->with(['error' => [__("Something is wrong in your card")]]);

select * from `basic_settings` limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
---


        $amount = $request->card_amount;
        $basic_setting = BasicSettings::first();
        $wallet = UserWallet::where('user_id',$user->id)->first();
        if(!$wallet){
            return back()->with(['error' => [__('User wallet not found')]]);
        }
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();

select * from `strowallet_virtual_cards` where `user_id` = 1 and `card_id` = 'db9983bb-a315-4791-a9cf-fc6408364b9f' limit 1
---
    public function cardTransaction($card_id) {
        $user = auth()->user();
        $card = StrowalletVirtualCard::where('user_id',$user->id)->where('card_id', $card_id)->first();