app/Http/Controllers/User/StrowalletVirtualController.php

    public function cardTransaction($card_id) {
        $user = auth()->user();
        $card = StrowalletVirtualCard::where('user_id',$user->id)->where('card_id', $card_id)->first();
---
select * from `strowallet_virtual_cards` where `user_id` = 1 and `card_id` = 'db9983bb-a315-4791-a9cf-fc6408364b9f' limit 1