app/Http/Controllers/User/TransactionController.php

    public function index($slug = null) {

        if($slug != null){
            $transactions = Transaction::auth()->where("type",$this->slugValue($slug))->orderByDesc("id")->paginate(12);
            $page_title = ucwords(remove_speacial_char($slug," ")) . " Log";
        }else {
            $transactions = Transaction::auth()->orderByDesc("id")->paginate(12);
---
select count(*) as aggregate from `transactions` where `user_id` = 5 and `type` = 'ADD-MONEY'
select * from `transactions` where `user_id` = 1 order by `id` desc limit 12 offset 0
select count(*) as aggregate from `transactions` where `user_id` = 1