app/Http/Helpers/helpers.php

select * from `user_wallets` where `user_id` = 1 limit 1
---
function authWalletBalance(){
    $wallet = UserWallet::where('user_id',auth()->user()->id)->first();

select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 4
---
function get_user_notifications()
{
    $user = auth()->user();
    $notifications = UserNotification::auth()->latest()->take(4)->get();

select * from `virtual_card_apis` limit 1
---
function virtual_card_system($name)
{
    $method = VirtualCardApi::first();

select * from `virtual_card_apis` limit 1
---
function flutterwaveBalance($secret_key = null){
    $cardApi = VirtualCardApi::first();

select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1 and `is_active` = 1
select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1 and `is_active` = 0
---
 function activeCardData(){
    if(virtual_card_system('flutterwave') == "flutterwave"){
        $virtual_cards = VirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  VirtualCard::where('user_id',auth()->user()->id)->where('is_active',1)->count();
        $inactive_cards = VirtualCard::where('user_id',auth()->user()->id)->where('is_active',0)->count();
    }elseif(virtual_card_system('sudo') == "sudo"){
        $virtual_cards = SudoVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  SudoVirtualCard::where('user_id',auth()->user()->id)->where('status',1)->count();
        $inactive_cards = SudoVirtualCard::where('user_id',auth()->user()->id)->where('status',0)->count();
    }elseif(virtual_card_system('stripe') == "stripe"){
        $virtual_cards = StripeVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  StripeVirtualCard::where('user_id',auth()->user()->id)->where('status',1)->count();
        $inactive_cards = StripeVirtualCard::where('user_id',auth()->user()->id)->where('status',0)->count();
    }elseif(virtual_card_system('strowallet') == "strowallet"){
        $virtual_cards = StrowalletVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  StrowalletVirtualCard::where('user_id',auth()->user()->id)->where('is_active',1)->count();
        $inactive_cards = StrowalletVirtualCard::where('user_id',auth()->user()->id)->where('is_active',0)->count();