app/Http/Helpers/strowallet-card.php

select * from `virtual_card_apis` limit 1
---
function create_strowallet_virtual_card($user,$cardAmount,$customer,$public_key,$base_url,$formData){
    $method = VirtualCardApi::first();

select * from `strowallet_virtual_cards` where `user_id` = 1 and `card_id` = 'db9983bb-a315-4791-a9cf-fc6408364b9f' limit 1
---
function updateStroWalletCardBalance($user,$card_id,$response){
    $card = StrowalletVirtualCard::where('user_id',$user->id)->where('card_id',$card_id)->first();