app/Http/Controllers/SiteController.php

    public function home(){
        $basic_settings = BasicSettings::first();
---
select * from `basic_settings` limit 1