app/Http/Controllers/Admin/AddMoneyController.php

select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY'
---
    public function index()
    {

        $page_title = __("All Logs");
        $transactions = Transaction::with(
          'user:id,firstname,lastname,email,username,full_mobile',
            'currency:id,name',
        )->where('type', 'ADD-MONEY')->latest()->paginate(20);