app/Http/Controllers/Admin/DashboardController.php

select * from `transactions` where `type` = 'ADD-MONEY' order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY'
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 1 and date(`created_at`) >= '2024-10-01' and date(`created_at`) <= '2024-10-13'
select sum(`request_amount`) as aggregate from `transactions` where `status` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) >= '2024-09-01' and date(`created_at`) <= '2024-09-31'
---
    public function index()
    {
        $page_title = __("Dashboard");
        $transactions = Transaction::with(
            'user:id,firstname,lastname,email,username,full_mobile',
              'currency:id,name'
          )->where('type', 'ADD-MONEY')->latest()->take(5)->get();

        $last_month_start =  date('Y-m-01', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $last_month_end =  date('Y-m-31', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $this_month_start = date('Y-m-01');
        $this_month_end = date('Y-m-d');
        $this_weak = date('Y-m-d', strtotime('-1 week', strtotime(date('Y-m-d'))));
        $this_month = date('Y-m-d', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $this_year = date('Y-m-d', strtotime('-1 year', strtotime(date('Y-m-d'))));

        // Dashboard box data
        // Add Money
        $add_money_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEADDMONEY)->where('status', 1)->sum('request_amount');
        $add_money_total_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEADDMONEY)->sum('request_amount');
        $today_add_money =  Transaction::toBase()
                            ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                            ->where('status', 1)
                            ->whereDate('created_at','>=',$this_month_start)
                            ->whereDate('created_at','<=',$this_month_end)
                            ->sum('request_amount');
        $last_month_add_money =  Transaction::toBase()->where('status', 1)
                                            ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                            ->whereDate('created_at','>=',$last_month_start)
                                            ->whereDate('created_at','<=',$last_month_end)
                                            ->sum('request_amount');

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 2
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 2 and date(`created_at`) >= '2024-10-01' and date(`created_at`) <= '2024-10-13'
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'ADD-MONEY' and date(`created_at`) >= '2024-09-01' and date(`created_at`) <= '2024-09-31'
---
        }

        // Pending Add Money
        $pending_add_money_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEADDMONEY)->where('status', 2)->sum('request_amount');
        $today_pending_add_money =  Transaction::toBase()
                                    ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                    ->where('status', 2)
                                    ->whereDate('created_at','>=',$this_month_start)
                                    ->whereDate('created_at','<=',$this_month_end)
                                    ->sum('request_amount');
        $last_month_pending_add_money =  Transaction::toBase()->where('status', 2)
                                            ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                            ->whereDate('created_at','>=',$last_month_start)
                                            ->whereDate('created_at','<=',$last_month_end)
                                            ->sum('request_amount');

select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `email_verified` = 0
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
---
            $pending_add_money_percent = (($pending_add_money_balance * 100) / $last_month_pending_add_money);
        }
        //User
        $total_user = User::toBase()->count();
        $unverified_user = User::toBase()->where('email_verified', 0)->count();
        $active_user = User::toBase()->where('status', 1)->count();
        $banned_user = User::toBase()->where('status', 0)->count();

select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2024-10-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2024-10-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2024-10-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2024-10-01' and `status` = 3
---
            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $success = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 1)
                                        ->count();
            $canceled = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 4)
                                        ->count();
            $hold = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 3)
                                        ->count();

select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2024-10-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2024-10-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2024-10-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2024-10-01' and `status` = 3
---
            $hold_data[]     = $hold;

            //Monthley virtual
            $card_pending = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 2)
                        ->count();
            $card_success = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 1)
                        ->count();
            $card_canceled = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 4)
                        ->count();
            $card_hold = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 3)
                        ->count();

select count(*) as aggregate from `blogs` where `status` = 1 and date(`created_at`) = '2024-10-01'
---

            // Event,Campaign,Gallery

            $event = Blog::where('status', 1)
            ->whereDate('created_at',$start_date)
            ->count();