app/Http/Controllers/Admin/UserCareController.php

select * from `users` where `username` = 'adejimi' limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and `status` = 1
---
    public function userDetails($username)
    {
        $page_title = __("User Details");
        $user = User::where('username', $username)->first();
        if (!$user) return back()->with(['error' => [__('Opps! User not exists')]]);

        $balance = UserWallet::where('user_id', $user->id)->first()->balance ?? 0;
        $add_money_amount = Transaction::toBase()->where('user_id', $user->id)->where('type', PaymentGatewayConst::TYPEADDMONEY)->where('status', 1)->sum('request_amount');

select * from `users` where `username` = 'adejimi' limit 1
---
    public function kycDetails($username)
    {
        $user = User::where("username", $username)->first();